--secured by zay
LJ‚    4     7  % > 7  4  777 : G  
BackpackLocalPlayerPlayersParent	MaskReplicatedStorageGetService	game     ˜4   7  % +  > (  : 4 7( ( ( >: +  7 : 4  7% +  >4 7'  ( '  >:	4 7( ( ( >:
Qâ€4 >+ 77
) :+ 7+ 7	 T €+ 7+ 7 T€+ + + !, + +  T€+ , T€+ 7+ 7	 T€+ 7+ 7	 T€+  T€+ , + '   T€. + 7+ 7	 T €+ 7+ 7 T9€4 7777+ 7+ 7 4 7774  7+ 7+ 7+ 7+  7   '   >7 4 7777+  :	3 + 7:+ 7:+ 7:+ 7:, TC€+ 7+ 7	 T5€+ 7+ 7	 T.€+  T+€4 7777+ 7+ 7 4 7774  7+ 7+ 7+ 7+  7   '   >7 4 7777+  :	T €4 7'  ( '  >:	4 7774  74 7+ 7+ 7 +  + !> '  '  > : +   T3 , 3 , .   7 > 7>+ 77
) :G  ÀÀ€€ À€€Destroy r l f b  r l f b rad	mathAngles  plookVectorCoordinateFrameCurrentCameraWorkspace	gamebfrlPlatformStand
HumanoidCharacter	wait
maxForce
velocityBodyVelocityCFramecframeVector3maxTorqueP
BodyGyronew
Instance þ
€€€ˆ‡ƒµæÌ™™³æý €€€ÿµæÌ™™³¦þdí 
 2  7  >  T	€+    T€/  T'€/  + >T#€  7  >  T€+ ' :T€  7  >  T€+ 'ÿÿ:T€  7  >  T€+ 'ÿÿ: T€  7  >  T€+ ' :	G  €  €rdlabsfwx
lower¯ 	 $  7  >  T€+  '  :T€  7  >  T€+  '  :T€  7  >  T€+  '  :T€  7  >   T€+  '  :G  €rdlabsfw
lower¶  HQ !€4   > 4  7  7     Tø4  7  7  7     Tò4  7  7  7    7  % >    Tè4  7  7  7    7  %  >    TÞ4  7  7    7  > Q€4  >   Tû4 7777) ) 3	 3
 ' 'ˆ1	 , 	 7	 
	 7	
	1 >	7	 
	 7	
	1 >	+	  >	0  €G  € 
KeyUp connectKeyDown  r l f b  r l f b 
GetMouse
Humanoid	HeadfindFirstChildCharacterLocalPlayerPlayers	game	wait]    4   7  7  7 7'd :G  WalkSpeed
HumanoidCharacterLocalPlayerPlayers	gameW    4   7  7  7  7  ) : G  Sit
HumanoidCharacterLocalPlayerPlayers	game‡    
4   7  7  7  4  777 : G  PlayerGuiLocalPlayerPlayersParentAdminsGUIBan/kick script incognitoWorkspace	game@    4   % > G   https://discord.gg/fJevq7Z2setclipboard÷    4   7  % +  > 7 4 7 7 4 777	4
 774
 7
7>:G  ÀSize420x420ThumbnailSize
HeadShotThumbnailType	EnumUserIdLocalPlayerGetUserThumbnailAsyncPlayers	game
ImageParentLocalScriptnew
Instance…  
 4   7  % +  > 7 % 4 7 77	$:G  À	NameLocalPlayerPlayers	game	TextParentLocalScriptnew
Instanceƒ   +   7   7   7   7  ) : +   7   7   7   7  ) : +   7   7   7   7  ) : G   ÀPlayer	MiscVisibleCombatParentx   
4   7  % +  > 7 7 71 >0  €G   À ConnectMouseButton1ClickParentLocalScriptnew
Instanceƒ   +   7   7   7   7  ) : +   7   7   7   7  ) : +   7   7   7   7  ) : G   ÀCombat	MiscVisiblePlayerParentx   
4   7  % +  > 7 7 71 >0  €G  À ConnectMouseButton1ClickParentLocalScriptnew
Instanceƒ   +   7   7   7   7  ) : +   7   7   7   7  ) : +   7   7   7   7  ) : G   ÀPlayerCombatVisible	MiscParentx   
4   7  % +  > 7 7 71 >0  €G  	À ConnectMouseButton1ClickParentLocalScriptnew
Instance  7  4 7 7 T€7 4 77 T€+  +  7 :G  ÀVisibleVKeyCode
Keyboard	EnumUserInputType¦ 
 4   7  % +  > 7 4  7% >7  71	 >0  €G  À ConnectInputBeganUserInputServiceGetService	gameParentLocalScriptnew
Instance   4   7    T €4   ) : +   7  % : T  €4   ) : +   7  % : G   ÀAimlock [OFF]Aimlock [On]	TextParentsilentaim _G?   +   4 7 7:  G  ÀLockCenter	EnumMouseBehaviorN   	/  / / +  4 7 7:  G  €
€€ÀDefault	EnumMouseBehaviorò   N4   7  )  4 +   7> = DA€+    T >€7   7  %	 >    T7€7   7  %	 > 7   '    T .€7   7  %	 >    T'€  T %€4 	 7 
    T!€7 + 	 74
	 7

6

 7

> 	 T
€4
 7

+ 7+ 7>
4 777
>

7


  T€+ 7
 T€ 
   BN½H ÀÀ
À	ÀÀRadiusMagnitudeYXnewVector2
PositionAimPartWorldToViewportPointsilentaim _GHumanoidRootPartHealth
HumanoidFindFirstChildCharacterGetPlayers
pairs	huge	mathÐ   17  4 7 7 T*€/  / / +   T$€4 >+    T€Q€4 7(  >+   Tõ
  Tó77 77+  + + 4  7	+ 7 7
7
>: + >TÞG  €
€€ÀÀ
ÀÀ
PositionlookAt
VelocityCFrameHumanoidRootPart	wait	taskFindNearestPlayerMouseButton2	EnumUserInputType›¶¯‹÷ÃõM  	7  4 7 7 T€+  >G  ÀMouseButton2	EnumUserInputTypeõ	 >˜4   7  % +  > 4 ) :7 7 7 1 >4	  7
% >4	  7
% >4	  7
%
 >4	  7
% >77 7 %	 > 	 7%
 >
 7	>	7
7) )
 ) (  4 7'  ( '  >4 ) :4 % :4 '  :4 '@ :4 4 7'ÿ '  '‚ >:4 '  :4 'È : 4 ) :!4 ) :"4 ' :#4$ 7%% >4' 77(
7)7(
7*>:&4 7 :+4 7!:,4 7:-4 7":.4 7:/4 7:04 7#:112 13 14 55 76 7 17 >78 7 19 >4	 7: 7;%< 3= >0  €G  À 	TextSuccess, Script Loaded.
Duration
Title
Working.SendNotificationSetCoreStarterGui InputEnded InputBeganFindNearestPlayer   Thickness
NumSidesTransparencyVisible
ColorFilledRadiusYXViewportSizeVector2
PositionCircleDrawingCircleThicknessCircleVisibleCircleFilledCircleRadiusCircleTransparencyfromRGBColor3CircleColorCircleSidesSensitivityAimPartTeamCheckVector3TeamColorCurrentCamera
GetMouse
HumanoidHumanoidRootPartFindFirstChildCharacterLocalPlayerPlayersUserInputServiceRunServiceWorkspaceGetService	game ConnectMouseButton1ClickParentsilentaim _GLocalScriptnew
Instance­¹è¢ßŸþµæÌ™™³æý§#  O… 4   7  % > 4  7% >4  7% >4  7% >4  7% >4  7% >4  7%  >4   7  %  > 4  7%	  >4	  7		%
  >	4
  7

% >
4  7% >4  7%
  >4
  7

%  >
4  7% >4  7%  >4  7%  >4  7%  >4  7% >4  7%  >4  7%  >4	 7
7 7%
 >: 4 77: % :: 4 7', ', ', >:4 7(  '  ( '  >:4 7'  'ì'  'š>:% ::4 7'$ '$ '$ >:4 7( '  '  '  >:4 7'  '« '  'š>:% ::4 7'ÿ 'ÿ 'ÿ >:4 7( '  ( '  >:4 7'  'l '  'i >:% :4 7' '  >::% ::4 7'ÿ 'ÿ 'ÿ >:' : 4 7( '  ( '  >:4 7'  'Ÿ '  '2 >:4 7!7":!%$ :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(%) ::4 7'$ '$ '$ >:4 7'  'ƒ '  'š>:%* : : 4 7' ' ' >: 4 7'  '  (  '  >: 4 7'  'ƒ '  '2 >: 4 7!7+:! %* :# 4 7'ÿ 'ÿ 'ÿ >:% ) :& ' :' ) :( %, ::4 7' ' ' >:4 7'  '  ( '  >:4 7'  'ƒ '  '2 >:4 7!7+:!%, :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(%- :	:	4 7' ' ' >:	4 7'  '  (	 '  >:	4 7'  'ƒ '  '2 >:	4 7!7+:!	%- :#	4 7'ÿ 'ÿ 'ÿ >:%	) :&	' :'	) :(	%. :
:
4 7'ÿ 'ÿ 'ÿ >:
' : 
4 7(
 '  '  '  >:
4 7'  'ƒ '  '2 >:
4 7!7":!
%/ :#
4 7'ÿ 'ÿ 'ÿ >:%
) :&
' :'
) :(
%* ::4 7', ', ', >:4 7( '  '  '  >:4 7'  '¾'  'š>:%0 ::4 7' ' ' >:4 7( '  (
 '  >:4 7'  'œ '  '2 >:4 7!7+:!%1 :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(%2 :
:
4 7' ' ' >:
4 7( '  (
 '  >:
4 7'  'œ '  '2 >:
4 7!7+:!
%3 :#
4 7'ÿ 'ÿ 'ÿ >:%
) :&
' :'
) :(
74
 7516 >%, ::4 7', ', ', >:4 7( '  '  '  >:4 7'  '¾'  'š>:) :7%8 ::4 7' ' ' >:4 7( '  ( '  >:4 7'  'ƒ '  '2 >:4 7!7+:!%9 :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(74 751: >%; ::4 7' ' ' >:4 7( '  ( '  >:4 7'  'ƒ '  '2 >:4 7!7+:!%< :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(74 751= >%> ::4 7' ' ' >:4 7( '  ( '  >:4 7'  'ƒ '  '2 >:4 7!7+:!%> :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(74 751? >%- ::4 7', ', ', >:4 7( '  '  '  >:4 7'  '¾'  'š>:) :7%@ ::4 7' ' ' >:4 7( '  ( '  >:4 7'  '« '  '2 >:4 7!7+:!%A :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(74 751B >%C ::4 7' ' ' >:4 7( '  ( '  >:4 7'  '« '  '2 >:4 7!7+:!%D :#4 7'ÿ 'ÿ 'ÿ >:%) :&' :') :(74 751E >1F 4G 7H >>1I 4G 7H >>1J 4G 7H >>1K 4G 7H >>1L 4G 7H >>1M 4G 7H >>1N 4G 7H >>0  €G        	wrapcoroutine  copy discord inviteDiscord Invite !AdminPanel [KICK ONLY WORKS]Admin panel Sit Walkspeed + 100WalkSpeed Fly [X]FlyVisible ConnectMouseButton1ClickGive Mask	MaskAimlock [OFF]AImlockRay ware v.1
Title	MiscPlayerSourceSansBoldCombatSideBarTextWrapped
TextSizeTextScaledTextColor3player.Name	TextLuckiestGuy	FontBackgroundTransparencyPlayeruser	UDimCornerRadius3rbxasset://textures/ui/GuiImagePlaceholder.png
ImagePlayersIconPlayerTab	Size
UDim2
PositionfromRGBColor3BackgroundColor3	Home	NameSibling	EnumZIndexBehaviorPlayerGuiWaitForChildLocalPlayerPlayers	gameParentTextButtonTextLabel
UICornerImageLabel
FrameScreenGuinew
Instanceó¦‹ùÄèÃþ‹·™ùÜØÀþ‰ÃõûºÞ¢ÿÑ¦½åèœþÑöñù ±õ”ýÀÅ…„î‡ý£÷À‡Ï…ÓþéÅ¼þ…Ó§þÿÀÍƒù±ðþÇ¬¸˜½–ÿéì¯‘ý€µùÁ¢é÷ÇÕ™þ‡Äéû · ýó¢ëö¡òíý»°‡Òýþáƒƒ“âËý•ø“ã±ðüý›û‡×ÄÚþõöäâÂôëýý¿Ñù í•Ñþ¿½Óƒ€á‰ÿ 
